import styles from '../styles/InfoMonblan.module.css';
import { useNavigate } from 'react-router-dom';

function InfoMonblan() {
  const navigate = useNavigate();

  const goToSecongPage = () => navigate('/places-monblan');
  return (
    <div className={styles.content_website}>
      <h1>Guide to the worlds</h1>
      <hr />
      <h2>Альпы</h2>
      <p>
        Альпы - стопроцентно туристическое и именно то место, где зарождался
        альпинизм. <span>Эта сфера была развита еще в 18-ом веке</span>.
      </p>
      <p>
        Альпы - это район международного туризма, альпинизма и горнолыжного
        спорта. Самый популярный маршрут - маршрут вокруг легендарного Монблана.
        Маршрут входит в десятку красивейших походов Мира,{' '}
        <span>пересекая при этом Францию, Италию и Швейцарию</span>. Страны
        соседствующие, но отличаются колоритом, природой. В Италии мы встретим
        холмы насыщенно зелёношо цвета, во Франции — живописные подъемы и
        спуски, а белоснежные пики вершин и чистейший ароматный воздух порадует
        в Швейцарии.
      </p>

      <h2>Поход вокруг Монблана</h2>
      <p>
        Тур дю Монблан - один из самых известных в мире походов на длинные
        дистанции, обход высочайшей вершины Западной Европы примерно в 170
        километрах.{' '}
        <span>
          Название "Тур дю Монблан" на французском языке означает буквально
          "вокруг Монблана"
        </span>
        . Как следует из названия, тропа ведет вокруг самой высокой горной
        вершины Западной Европы. Его ландшафт - один из самых впечатляющих в
        Европе, с потрясающим и разнообразным сочетанием ледников, альпийских
        лугов, заснеженных вершин, озер, рек и водопадов, что делает его
        чрезвычайно популярным среди туристов и любителей пеших походов.
      </p>
      <figure>
        <img
          className="img_monblan"
          src="https://triplook.me/media/resorts/photo/e/f/fb7.jpg"
          alt="Monblan"
        />
        <figcaption>Прекраснейший пейзаж Тур дю Монблан</figcaption>
      </figure>
      <h2>Данные тропы Тур дю Монблан</h2>
      <ul>
        <li>Общая длина: Около 170 км</li>
        <li>Общий набор высоты: Около 10 000 м</li>
        <li>Количество этапов: 11</li>
        <li>Страны: Франция, Италия, Швейцария</li>
      </ul>
      <p>
        Далее мы поговорим о местах, которые встречаются в походе по тропе Тур
        дю Монблан. Помимо позновательной информации вы увидете фото с красивыми
        пейзажами.
      </p>
      <button onClick={goToSecongPage}>Далее..</button>
    </div>
  );
}

export default InfoMonblan;